InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗанятостьКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗанятостьКлиентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Занятость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСоСправочниками/Ext/Module.bsl
Функция РозничнаяЦена(АктуальнаяДата, ЭлементНоменклатуры) Экспорт
	Отбор = Новый Структура("Номенклатура", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.Цены.ПолучитьПоследнее(АктуальнаяДата,Отбор);
    Возврат ЗначениеРесурсов.Цена;	 
КонецФункции    

Функция ОпределениеСтатусаСотрудника(АктуальнаяДата ,КакойНитьЭлемент) Экспорт
	Отбор = Новый Структура("Статус", КакойНитьЭлемент);
	ЗначениеРесурсов = РегистрыСведений.ЗанятостьКлиентов.ПолучитьПоследнее(АктуальнаяДата,Отбор);
	Возврат  ЗначениеРесурсов.Занятость;
КонецФункции
